using Anthropic.SDK;
using CloaudeAiLibrary;
using DataModelsLibrary.Queries;
using dotenv.net;
using Microsoft.Extensions.DependencyInjection;
using Microsoft.Extensions.Hosting;

internal class Program
{
    private static async Task Main(string[] args)
    {
        using IHost host = Host.CreateDefaultBuilder(args)


.ConfigureAppConfiguration(app =>
{

})
.ConfigureServices((_, services) =>
{
    DotEnv.Load();
    var envVars = DotEnv.Read();
    var apiKey = envVars["API_KEY"].Trim();
    var host = envVars["QDRANT_HOST"].Trim();
    var port = int.Parse(envVars["QDRANT_PORT"]);

    services.AddSingleton<AnthropicClient>(_ =>
    new AnthropicClient(
        new APIAuthentication(apiKey)
    ));

    services.AddTransient<ICvParserService, CvParserService>();

})
.Build();

        //string cvTxt = @" אברהם כהן שם: אברהם כהן דוא""ל: avrhm450@gmail.com כתובת: קריית אתא טל' : 0525840520 פרופיל מקצועי: מהנדס תעשייה וניהול בהתמחות במערכות מידע. מיישם פריוריטי מוסמך ע""י מכללת ""אין-ליין"" , ובעל ניסיון מוכח ביישום מערכת PRIORITY , ניהול פרויקטים , ניתוח תהליכים, ומתן שירות תמיכה למשתמשים. בעל יכולות אנליטיות גבוהות , שליטה מלאה ב-EXCEL, ויחסי אנוש מצוינים . מחפש תפקיד מאתגר בתחום מערכות מידע , עם אפשרות להתפתחות אישית ומקצועית. כישורים טכניים : * PRIORITY ERP- מיישם פריוריטי, עבודה בכל המודולים ומתן שירות למשתמשים. כולל התמחות באפליקציית פריוריטי ומתן תמיכה מלאה לשירותי האפליקציה. * Office/Excel – אקסל ברמה גבוהה מאוד –פונקציות ונוסחאות vlookup , pivot * מיומנויות אנליטיות, ניהול עצמי, מיומנויות תקשורת מילולית וכתובה , חזקות באנגלית, לומד מהר, מיומנויות הצגה. * יחסי אנוש מעולים, עבודת צוות, יכולת לפעול תחת לחץ. ניסיון תעסוקתי: 2024-הווה : מיישם פריוריטי בחברת אמיליה ,טיפול שוטף בתקלות וניהול מערכת ומשתמשים , ניהול פרויקטים פנים ארגוניים , תמיכה באפליקציית פריוריטי ועבודה בצוות. 2023- עבודה על פרויקט זמני בחברת ""ITC"" של מציאת רווחיות מול תאגידים, עבודה על מערכות ניהול קשרי לקוחות ו- EXCEL , ועבודה מול בעלי תפקידים שונים בחברה. 2022- עבודה בחברת ""קורנית דיגיטל"" במשרת סטודנט בתור מטמיע מערכת מידע, עבודה רבה על EXCEL ,Priority ועבודה מול בכירים בארגון. השכלה: מכללת ""אין-ליין"" – מיישם פריוריטי. אוניברסיטת אריאל - תואר ראשון בהנדסת תעשייה וניהול בהתמחות במערכות מידע. בית ספר- ישיבת בני עקיבא במירון - בגרות מלאה . שירות צבאי: 2014-2018 : חיל התותחנים-שחרור בדרגת סגן (תפקיד אחרון: סגן מפקד פלוגה). תפקידים שביצעתי במסגרת הצבאית: * מפקד צוות – הדרכת חיילים וניהול משימות שוטפות. * מפקד מחלקה – ניהול כ30 חיילים תחת תנאי לחץ ודאגה לצרכים אישיים. * סגן מפקד פלוגה – ניהול כ80 חיילים, ניהול לו""ז יומי ועבודה מול גורמים בכירים. שפות: עברית-שפת אם. אנגלית-ברמה טובה. שמות ממליצים יינתנו עפ""י דרישה ";
        string cvTxt = @"ליאור יום טוב, רו""ח מגורים: ראשון לציון| ש.לידה: 1976 | 052-2260118 | yomtovel@gmail.com * סמנכ""ל כספים, בעל ניסיון מוכח בהובלה פיננסית של חברות גדולות על מכלול פעילויותיהם. * ניסיון רב בניהול כספים, בקרות תקציב, הכנת תחזיות שנתיות, ניהול סיכונים; ניהול מח' הנה""ח וגזברות. * הובלת תהליכים לצמיחה וצמצום בעלויות תפעול באופן ניכר תוך זיהוי הזדמנויות עסקיות בשוק, הסדרת תהליכי עבודה. * ראיה מערכתית ועסקית רחבה, אתיקה מקצועית, יכולת הנעת תהליכים וקבלת החלטות בזמן אמת, יחסי אנוש טובים. ניסיון תעסוקתי: 2021- 2018 : סמנכ""ל כספים ומשנה מנכ""ל קבוצת חברות אנרגיה * אחריות למערך החשבונאי-פיננסי של החברה חבר הנהלה יד ימין מנכ""ל ובעלי החברה. * ניהול צוות עובדים ושיקום המערך הכספי פיננסי שלך החברה. * פרויקטים גדולים בתחום האנרגיה והגז. שיווק ומכירות בכל תחומי החברה. * הטמעת מערכת פריוריטי | אוריינטציה למחשוב וייעול כח אדם. 2017- 2011 : סמנכ""ל כספים ברשתות Toys R Us והפיראט האדום (קבוצת פישמן) * אחריות למערך החשבונאי-פיננסי של החברה וחבר הנהלה. * ניהול צוות עובדים (כ 10 עובדים). אוריינטציה למחשוב וייעול כוח אדם (המחלקה מנתה 15 עובדים). * ניהול תזרים מזומנים, רווח והפסד מול תקציב, אשראי וגבייה, דוחות הנהלה שוטפים. * הטמעת נהלי עבודה ומדיניות וכו’. * החברה מונה כ 50 סניפים (מתוכם כ 20 סניפים בזכיינות). 2008-2011 : חשב בקבוצת קל אוטו * הכנת דוחות חודשיים להנהלה, וניתוחם. בקרת כל תחומי החברה (קבוצת חברות עם כ 7 תחומי פעילות מגוונים). * אחריות וניהול צוות הנהלת החשבונות (מעל 10 מנהלי חשבונות). * ממשקים עם כל הגורמים בחברה ובקרתם (תפעול, ליסינג, השכרה, מכירות וכו'). * קשר רציף מול הרואה החשבון לצורך הכנת הדוחות הכספיים (שנתיים ורבעוניים). * מעקב גבייה. בקרה על תשלומים לספקים. בניית תזרים מזומנים. * ייעול המערכת (שיטות עבודה, הגדרת אחריות, דיווח, הצלבות מתוחכמות, דוחות לחברה ואיחודה). 2008 - 2003 : מנג'ר וסגן שותף זיו האפט BDO * ניהול צוות עובדים והדרכתם. * ביקורת חברות היי-טק בורסאיות מאוחדים (רבעוניים ושנתיים). * הגשת תשקיפים לרשות לניירות ערך. * ניסיון בתקני ה USGAAP, הכנת דוחות רבעוניים לבורסה ע""פ ה-IFRS * הטמעת נהלי עבודה ומדיניות וכו’. הטמעת ה SOX. מיזוג פעילות ואישור PPA. * ניסיון בביקורת חברת דלק, חברות תעשייתיות (ע""פ חוק עידוד השקעות הון), הגשת דוחות למדען הראשי והגשת בקשות למענקים. ניסיון נרחב בביקורת חברות (חברות פרטיות, חברות עירוניות, חברות בית, ביקורת דוחות נומינליים ודוחות מותאמים).ביקורת עמותות גדולות. אחראי ביקורת משרד ממשלתי. ניסיון בהגשת דוחות לעצמאיים והצהרות הון. ביקורת הדוחות (דוחות כספיים ודוחות למס הכנסה) כולל עריכתם באמצעות שיטות מתקדמות. השכלה: 2003-2000 לימודי ראיית חשבון ב""מכללה למנהל"" במסלול ""חשבונאות לאחר תואר""| רו""ח מוסמך (2005). 1995-1999 תואר ראשון במדעי החברה (מנהל עסקים) באוניברסיטה הפתוחה. 1995-1999 תעודת הוראה (מוסמך בכיר) במכללה האקדמית ""מורשת יעקב"". 1991-1994 תעודת בגרות (מגמה פיסיקלית) בישיבה התיכונית ""כפר הרוא""ה"". יישומי מחשב: שליטה מלאה ב Office | ERP (אוריינטציה למחשוב). שירות צבאי: לוחם בגבעתי . ניסיון בהדרכה: במשך ארבע שנים השתתפתי בפרויקט פר""ח (הצטיינות). ניסיון בהוראה: שנת תשס""א (9/00-9/01) מורה לכיתות ה'-ו' (מחשבים, תגבור במתמטיקה ותלמוד). שפות: עברית: שפת אם, אנגלית: רמה גבוהה. ";

        //string cvTxt = @" אברהם כהן שם: אברהם כהן דוא""ל: avrhm450@gmail.com כתובת: קריית אתא טל' : 0525840520 פרופיל מקצועי: מהנדס תעשייה וניהול";


        var cvParserService = host.Services.GetRequiredService<ICvParserService>();
        await cvParserService.ParseAsync(cvTxt);


        ////var analyzeCvsService = host.Services.GetRequiredService<IAnalyzeCvsService>();
        //var embedderStoreService = host.Services.GetRequiredService<IEmbedderStoreService>();
        ////var searcherService = host.Services.GetRequiredService<ISearcherService>();

        ////await analyzeCvsService.AiAnalyzeAndStoreAllCandidatesLastCvVer2();
        //await embedderStoreService.EmbedAnalyzedCvs();
        ////await searcherService.DemoSearch();

        Console.WriteLine();
    }
}